Repository: blablazzz/kevin-woocommerce
Catalog: languages/woocommerce-gateway-getkevin-*.po
Languages: et, lt_lt, lv_lv

source: kevin. is a payment infrastructure company which offers payment initiation service in EU&EEA.
et: kevin. on makseinfrastruktuuriettevõte, mis pakub makse algatamise teenust ELis ja EMPs.
lt_lt: kevin. yra mokėjimų infrastruktūros kompanija, kuri siūlo mokėjimo inicijavimo paslaugą ES ir EEA šalyse.
lv_lv: kevin. ir maksājumu infrastruktūras uzņēmums, kas piedāvā maksājumu iniciēšanas pakalpojumus ES un EEZ.

source: Main Settings
et: Põhiseaded
lt_lt: Pagrindiniai Nustatymai
lv_lv: Galvenie iestatījumi

source: Order statuses
et: Tellimuse staatused
lt_lt: Užsakymų būsenos
lv_lv: Pasūtījumu statusi

source: Client ID must be made from letters, digits and special character (-). (Ex: 111111bb-ccc2-45df-9afC-e111dd000000).
et: Kliendi ID peab olema loodud tähtedest, numbritest ja erimärkidest (-). (Nt: 111111bb-ccc2-45df-9afC-e111dd000000).
lt_lt: Client ID susidaro iš raidžių, skaičių ir specialiųjų simbolių (-). (Pvz.: 111111bb-ccc2-45df-9afC-e111dd000000).
lv_lv: Klienta ID ir jāsastāv no burtiem, cipariem un speciālām rakstzīmēm (-). (Piem. 111111bb-ccc2-45df-9afC-e111dd000000).

source: Client secret must be a string from letters and digits.
et: Klienti saladus peab olema string tähtede ja numbritega.
lt_lt: Client Secret susidaro iš raidžių ir skaičių.
lv_lv: Klienta noslēpums sastāv no burtiem un cipariem.

source: Creditor name must be a string without any special characters.
et: Krediitori nime string peab olema ilma erimärkideta.
lt_lt: Gavėjo vardas turi būti nurodytas lotyniškomis raidėmis be specialiųjų simbolių.
lv_lv: Kreditora nosaukumam ir jābūt virknei bez speciālām rakstzīmēm.

source: Creditor account field must valid IBAN (Ex: LT01234567891011121314).
et: Krediitori konto väli peab olema kehtiv IBAN (nt: EE01234567891011121314).
lt_lt: Gavėjo banko sąskaita turi būti galiojantis IBAN (Pvz.: LT01234567891011121314)
lv_lv: Kreditora konta laukam ir jābūt derīgam IBAN (Piem. LT01234567891011121314)

source: Please select your bank.
et: Palun valige oma pank.
lt_lt: Pasirinkite savo banką.
lv_lv: Lūdzu, izvēlēties savu banku.

source: kevin. Payment started.
et: kevin. makse algas.
lv_lv: kevin. Maksājums ir uzsākts.

source: kevin. Refund status is now: %s
et: kevin. tagasimakse olek on nüüd: %s
lt_lt: kevin. grąžinimo būsena dabar yra: %s
lv_lv: kevin. Atmaksas statuss tagad ir: %s

source: kevin. Refund status changed to
et: kevin. tagasimakse olek on muudetud
lt_lt: kevin. grąžinimo būsena pasikeitė į
lv_lv: kevin. Atmaksas statuss ir mainījies uz

source: kevin. Duplicate webhook: Payment status is %s
et: kevin. veebikonksu duplikaat: makse olek on %s
lv_lv: kevin. Tīmekļa āķa (Webhook) dublikāts: Maksājuma statuss ir %s

source: kevin. Customer came back to thank you page
et: kevin. klient tuli tagasi tänu lehele
lt_lt: kevin. klientas sugrąžintas į "Ačiū" puslapį
lv_lv: kevin. Klients ir atgriezies uz "Paldies" lapu

source: kevin. Payment status is %s
et: kevin. makse olek on %s
lt_lt: kevin. mokėjimo būsena yra %s
lv_lv: kevin. Maksājuma statuss ir %s

source: kevin. Payment status changed to
et: kevin. makse olek muudetud
lt_lt: kevin. mokėjimo būsena pasikeitė į
lv_lv: kevin. Maksājuma statuss is mainījies uz

source: kevin. Payment id is %s
et: kevin. makse ID on %s
lt_lt: kevin. Payment ID yra %s
lv_lv: kevin. Maskājuma ID ir %s

source: Refund failed.
et: Tagasimakse ebaõnnestus.
lt_lt: Grąžinimas nepavyko.
lv_lv: Atmaksa neizdevās.

source: Starting refund process. Amount %1$s, Payment ID: %2$s, Reason: %3$s
et: Tagasimakse protsessi alustamine. Summa %1$s, makse ID: %2$s, põhjus: %3$s
lt_lt: Pradedamas grąžinimo procesas. Suma %1$s, Mokėjimo ID: %2$s, Priežastis: %3$s
lv_lv: Atmaksas process ir sācies. Summa %1$s, Maksājuma ID: %2$s, Iemesls: %3$s

source: kevin. Refund failed: %1$s
et: kevin. tagasimakse ebaõnnestus: %1$s
lt_lt: kevin. grąžinimas nepavyko: %1$s
lv_lv: kevin. Atmaksa neizdevās: %1$s

source: Refund process started. Amount %1$s
et: Tagasimakse protsess algas. Summa %1$s
lt_lt: Grąžinimo procesas prasidėjo. Suma %1$s
lv_lv: Atmaksas process ir sācies. Summa %1$s

source: Unfortunately, your order cannot be processed as the originating bank has declined your transaction. Please attempt your purchase again.
et: Kahjuks ei saa teie tellimust töödelda, kuna maksepank on teie tehingu tagasi lükanud. Palun proovige uuesti osta.
lt_lt: Deja, bet jūsų užsakymas negali būti įvykdytas, nes bankas atmetė jūsų mokėjimą. Pabandykite sumokėti dar kartą.
lv_lv: Diemžēl pasūtījumu nevar apstrādāt, jo banka ir noraidījusi Jūsu transakciju. Lūdzu, mēģiniet veikt pirkumu vēlreiz.

source: Pay
et: Maksa
lt_lt: Mokėti
lv_lv: Maksāt

source: My account
et: Minu konto
lt_lt: Mano paskyra
lv_lv: Mans konts

source: Thank you for your payment. Your transaction has been completed, and a receipt for your purchase has been emailed to you.
et: Tänan makse eest. Teie tehing on lõpule viidud ja teile saadeti teie ostukviitung e-postiga.
lt_lt: Ačiū už jūsų mokėjimą. Jūsų mokėjimas buvo sėkmingai įvykdytas, o mokėjimo informacija išsiųsta jūsų el. pašto adresu.
lv_lv: Paldies par maksājumu. Transakcija ir pabeigta, kvīts par pirkumu jums ir nosūtīta pa e-pastu.

source: Payment initiation was cancelled. Please try again.
et: Makse algatamine tühistati. Palun proovi uuesti.
lt_lt: Mokėjimo inicijavimas buvo atšauktas. Pabandykite dar kartą.
lv_lv: Maksājuma iniciēšana tika atcelta. Lūdzu, mēģiniet vēlreiz.

source: We will start executing the order only after receiving the payment.
et: Hakkame tellimust täitma peale makse laekumist.
lt_lt: Pradėsime vykdyti užsakymą, kai gausime mokėjimą.
lv_lv: Pasūtījumu mēs sāksim izpildīt tikai pēc maksājuma saņemšanas.

source: WooCommerce Payment Gateway - kevin.
et: WooCommerce Makse Värav - kevin.
lv_lv: WooCommerce Maksājumu Vārteja - kevin.

source: Settings
et: Sätted
lt_lt: Nustatymai
lv_lv: Uzstādījumi

source: Enable/Disable
et: Luba / Keela
lt_lt: Įjungti/Išjungti
lv_lv: Iespējot/Atspējot

source: Enable kevin.
et: Luba kevin.
lv_lv: Iespējot kevin.

source: Title
et: Tiitel
lt_lt: Pavadinimas
lv_lv: Nosaukums

source: This controls the title which the user sees during checkout.
et: See kontrollib tiitlit, mida kasutaja kassas näeb.
lv_lv: Tas kontrolē nosaukumu, ko lietotājs redz izrakstīšanās laikā.

source: Description
et: Kirjeldus
lt_lt: Aprašymas
lv_lv: Apraksts

source: This controls the description which the user sees during checkout.
et: See kontrollib kirjeldust, mida kasutaja kassas näeb.
lv_lv: Tas kontrolē aprakstu, ko lietotājs redz izrakstīšanās laikā.

source: Choose a payment method via kevin.
et: Valige makseviis kevini kaudu.
lt_lt: Pasirinkite mokėjimo būdą per kevin.
lv_lv: Izvēlieties maksājuma veidu, izmantojot pakalpojumu Kevin.

source: Client ID
et: Kliendi ID
lv_lv: Klienta ID

source: Your client id. Your can get it in kevin. platform console.
et: Teie kliendi ID. (Kui te pole seda veel saanud, võtke ühendust klienditoega help@kevin.eu)
lt_lt: Jūsų Client ID. Galite gauti kevin. platformos konsolėje.
lv_lv: Tavs klienta ID. Lai to saņemtu, sazinieties ar savu pārdevēju vai nosūtiet mums tiešo pieprasījumu uz e-pastu help@kevin.eu.

source: Client Secret
et: Kliendi saladus
lv_lv: Klienta noslēpums

source: Your client secret. Your can get it in kevin. platform console.
et: Teie kliendi saladus. (Kui te pole seda veel saanud, võtke ühendust klienditoega help@kevin.eu)
lt_lt: Jūsų Client Secret. Galite gauti kevin. platformos konsolėje.
lv_lv: Tavs klienta noslēpums. Lai to saņemtu, sazinieties ar savu pārdevēju vai nosūtiet mums tiešo pieprasījumu uz e-pastu help@kevin.eu.

source: Company Name
et: Ettevõtte nimi
lt_lt: Įmonės pavadinimas
lv_lv: Uzņēmuma nosaukums

source: Company Bank Account
et: Ettevõtte pangakonto
lt_lt: Įmonės banko sąskaita
lv_lv: Uzņēmuma bankas konts

source: Redirect Preferred
et: Ümbersuunamine eelistatud
lv_lv: Pārvirzīšana izvēlēta

source: Redirect user directly to bank.
et: Kasutaja ümbersuunamine panka.
lt_lt: Nukreipti mokėtoją į banko aplinką.
lv_lv: Pārvirzīt lietotājus pa tiešo uz banku.

source: New order status
et: Uus tellimuse staatus
lt_lt: Naujo užsakymo būsena
lv_lv: Jauns pasūtījuma statuss

source: Status of a new order that has been created
et: Uus tellimuse staatus on loodud
lt_lt: Naujo užsakymo, kuris buvo atšauktas, būsena
lv_lv: Jauna pasūtījuma statuss ir izveidots

source: Paid order status
et: Makstud tellimuse staatus
lt_lt: Apmokėto užsakymo būsena
lv_lv: Apmaksas pasūtījuma statuss

source: Status of an order that has been successfully paid.
et: Tellimuse staatus mis on edukalt tasutud.
lv_lv: Veiksmīgi apmaksāta pasūtījuma statuss.

source: Pending checkout
et: Kassas ootel
lv_lv: Gaida galapārbaudi

source: Status of an order that has not been paid yet.
et: Tellimuse staatus mis ei ole veel tasutud.
lt_lt: Neapmokėto užsakymo būsena
lv_lv: Pasūtījuma statuss, par kuru vēl nav samaksāts.

source: kevin. payment started.
lt_lt: kevin. mokėjimas pradėtas

source: Enable Getkevin.
lt_lt: Įjungti kevin. modulį
